#!/bin/bash
computer=$[RANDOM%3+1]
clear
echo "##########################"
echo "#     石头剪刀布游戏	 #"
echo -e "#\033[32m  请根据下面提示出拳：  \033[0m#"
echo "##########################"
echo "|---------------|"
echo "|	1.石头	|"
echo "|	2.剪刀  |"
echo "|	3.布    |"
echo "|---------------|"
echo
read -p "请您出拳头[1-3]:" person
clear
case $person in
1)
	if [[ $computer == 1 ]]; then
		echo "-----------------------"
		echo "    您出拳：石头       "
		echo "    电脑出拳：石头     "
		echo "-----------------------"
		echo -e "\033[32m平局\033[0m"
	elif [[ $computer == 2 ]]; then
		echo "-----------------------"
		echo "    您出拳：石头       "
		echo "    电脑出拳：剪刀     "
		echo "-----------------------"
		echo -e "\033[32m恭喜，您赢了\033[0m"
	elif [[ $computer == 3 ]]; then
		echo "-----------------------"
		echo "    您出拳：石头       "
		echo "    电脑出拳：布       "
		echo "-----------------------"
		echo -e "\033[32m电脑赢了\033[0m"
	fi;;
2)
	if [[ $computer == 1 ]]; then
		echo "-----------------------"
		echo "    您出拳：剪刀       "
		echo "    电脑出拳：石头     "
		echo "-----------------------"
		echo -e "\033[32m电脑赢了\033[0m"
	elif [[ $computer == 2 ]]; then
		echo "-----------------------"
		echo "    您出拳：剪刀       "
		echo "    电脑出拳：剪刀     "
		echo "-----------------------"
		echo -e "\033[32m平局\033[0m"
	elif [[ $computer == 3 ]]; then
		echo "-----------------------"
		echo "    您出拳：剪刀       "
		echo "    电脑出拳：布       "
		echo "-----------------------"
		echo -e "\033[32m您赢了\033[0m"
	fi;;
3)
	if [[ $computer == 1 ]]; then
		echo "-----------------------"
		echo "    您出拳：布         "
		echo "    电脑出拳：石头     "
		echo "-----------------------"
		echo -e "\033[32m您赢了\033[0m"
	elif [[ $computer == 2 ]]; then
		echo "-----------------------"
		echo "    您出拳：布         "
		echo "    电脑出拳：剪刀     "
		echo "-----------------------"
		echo -e "\033[32m电脑赢了\033[0m"
	elif [[ $computer == 3 ]]; then
		echo "-----------------------"
		echo "    您出拳：布         "
		echo "    电脑出拳：布       "
		echo "-----------------------"
		echo -e "\033[32m平局\033[0m"
	fi;;
*)
	echo -e "\033[91m无效的输入值，请输入1-3选项！\033[0m"
esac

